Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 417, 64)           778752    
_________________________________________________________________
bidirectional (Bidirectional (None, 417, 256)          197632    
_________________________________________________________________
dense (Dense)                (None, 417, 64)           16448     
_________________________________________________________________
flatten (Flatten)            (None, 26688)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 26689     
=================================================================
Total params: 1,019,521
Trainable params: 1,019,521
Non-trainable params: 0
_________________________________________________________________
None
Train on 457135 samples, validate on 195915 samples
Epoch 1/6
457135/457135 [==============================] - 5289s 12ms/sample - loss: 0.0844 - accuracy: 0.9702 - val_loss: 0.0550 - val_accuracy: 0.9842
Epoch 2/6
457135/457135 [==============================] - 5634s 12ms/sample - loss: 0.0445 - accuracy: 0.9867 - val_loss: 0.0509 - val_accuracy: 0.9852
Epoch 3/6
457135/457135 [==============================] - 5264s 12ms/sample - loss: 0.0279 - accuracy: 0.9910 - val_loss: 0.0582 - val_accuracy: 0.9849
Epoch 4/6
457135/457135 [==============================] - 5270s 12ms/sample - loss: 0.0149 - accuracy: 0.9950 - val_loss: 0.0719 - val_accuracy: 0.9846
Epoch 5/6
457135/457135 [==============================] - 5277s 12ms/sample - loss: 0.0086 - accuracy: 0.9971 - val_loss: 0.0828 - val_accuracy: 0.9848
Epoch 6/6
457135/457135 [==============================] - 5280s 12ms/sample - loss: 0.0065 - accuracy: 0.9977 - val_loss: 0.0975 - val_accuracy: 0.9836

